app/controllers/detalhe_cursos_controller.rb

SELECT `detalhe_cursos`.* FROM `detalhe_cursos` WHERE `detalhe_cursos`.`curso_id` = 1
---
	def show
		@content = DetalheCurso.by_id(params[:curso]).all