app/controllers/home_controller.rb

SELECT `cursos`.* FROM `cursos` ORDER BY Cursos.name ASC
---
  def index
    @cursos = Curso.order("Cursos.id ASC")